lkesteloot/alice/alice3/io_board/stm32f4/ioboard.c
    set_GPIO_value(BUS_WR_PORT, BUS_WR_PIN_MASK, BUS_WR_INACTIVE);
    set_GPIO_value(BUS_IORQ_PORT, BUS_IORQ_PIN_MASK, BUS_IORQ_INACTIVE);
}

// Caller has to guarantee A and D access will not collide with
// another peripheral
// Caller has to save and restore D if desired
// Caller has to BUS_start() before and BUS_finish() after
// Caller has to set DATA as input
unsigned char BUS_read_io_byte(unsigned int a)
{
    BUS_set_ADDRESS(a);

    set_GPIO_value(BUS_IORQ_PORT, BUS_IORQ_PIN_MASK, BUS_IORQ_ACTIVE);
    set_GPIO_value(BUS_RD_PORT, BUS_RD_PIN_MASK, BUS_RD_ACTIVE);

    delay_us(IO_DELAY_MICROS);
    unsigned char d = BUS_get_DATA();

    set_GPIO_value(BUS_RD_PORT, BUS_RD_PIN_MASK, BUS_RD_INACTIVE);
    set_GPIO_value(BUS_IORQ_PORT, BUS_IORQ_PIN_MASK, BUS_IORQ_INACTIVE);

    return d;
}

int gInRESETBeforeMastering = 0;

// Saves
void BUS_mastering_start()
{
    gInRESETBeforeMastering = !HAL_GPIO_ReadPin(Z80_RESET_PORT, Z80_RESET_PIN_MASK);
    BUS_acquire_bus(gInRESETBeforeMastering);

    BUS_set_ADDRESS(0);
    BUS_set_ADDRESS_as_output();

    HAL_NVIC_DisableIRQ(EXTI1_IRQn); // Stop /RD from interrupting
    HAL_NVIC_DisableIRQ(EXTI2_IRQn); // Stop /WR from interrupting

    set_GPIO_iotype(BUS_IORQ_PORT, BUS_IORQ_PIN, GPIO_MODE_OUTPUT_PP);
    set_GPIO_iotype(BUS_MREQ_PORT, BUS_MREQ_PIN, GPIO_MODE_OUTPUT_PP);
    set_GPIO_iotype(BUS_RD_PORT, BUS_RD_PIN, GPIO_MODE_OUTPUT_PP);
    set_GPIO_iotype(BUS_WR_PORT, BUS_WR_PIN, GPIO_MODE_OUTPUT_PP);
}

void BUS_mastering_finish()
{
    set_GPIO_iotype(BUS_WR_PORT, BUS_WR_PIN, GPIO_MODE_INPUT);
    set_GPIO_iotype(BUS_RD_PORT, BUS_RD_PIN, GPIO_MODE_INPUT);
    set_GPIO_iotype(BUS_MREQ_PORT, BUS_MREQ_PIN, GPIO_MODE_INPUT);
    set_GPIO_iotype(BUS_IORQ_PORT, BUS_IORQ_PIN, GPIO_MODE_INPUT);

    HAL_NVIC_EnableIRQ(EXTI2_IRQn); // /WR will interrupt
    HAL_NVIC_EnableIRQ(EXTI1_IRQn); // /RD will interrupt

    BUS_set_ADDRESS_as_input();

    BUS_release_bus(gInRESETBeforeMastering);
}

void BUS_init()
{
    command_clear();
    response_clear();

    GPIO_InitTypeDef  GPIO_InitStruct;

    // configure PORT A0:A7 (bus D0..D7) outputs for later
    GPIOA->OSPEEDR = (GPIOA->OSPEEDR & ~0xffff) | 0x0000;   // LOW
    GPIOA->OTYPER = (GPIOA->OTYPER & 0xff) | 0x0000;        // PUSH_PULL
    GPIOA->PUPDR = (GPIOA->PUPDR & 0xffff) | 0x0000;        // no PUPD

    BUS_set_DATA_as_input();

    GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_HIGH;

    // RD and WR are port C pins 1, 2 as inputs driving interrupts
    GPIO_InitStruct.Pin = BUS_RD_PIN_MASK | BUS_WR_PIN_MASK;
    GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(BUS_SIGNAL_CHECK_PORT, &GPIO_InitStruct); 
    set_GPIO_value(BUS_RD_PORT, BUS_RD_PIN_MASK, BUS_RD_INACTIVE);
    set_GPIO_value(BUS_WR_PORT, BUS_WR_PIN_MASK, BUS_WR_INACTIVE);

    /* Enable and set EXTI Line1 Interrupt to the highest priority */
    HAL_NVIC_SetPriority(EXTI1_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(EXTI1_IRQn);

    /* Enable and set EXTI Line2 Interrupt to the highest priority */
    HAL_NVIC_SetPriority(EXTI2_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(EXTI2_IRQn);

    // IORQ and A7 are port C pins 0, 4, as inputs
    GPIO_InitStruct.Pin = BUS_IORQ_PIN_MASK | BUS_A7_PIN_MASK;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(BUS_SIGNAL_CHECK_PORT, &GPIO_InitStruct); 
    set_GPIO_value(BUS_IORQ_PORT, BUS_IORQ_PIN_MASK, BUS_IORQ_INACTIVE);

    // MREQ
    GPIO_InitStruct.Pin = BUS_MREQ_PIN_MASK;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(BUS_MREQ_PORT, &GPIO_InitStruct); 
    set_GPIO_value(BUS_MREQ_PORT, BUS_MREQ_PIN_MASK, BUS_MREQ_INACTIVE);

    // HALT
    GPIO_InitStruct.Pin = BUS_HALT_PIN_MASK;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(BUS_HALT_PORT, &GPIO_InitStruct); 

    // BUSRQ
    GPIO_InitStruct.Pin = BUS_BUSRQ_PIN_MASK;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(BUS_BUSRQ_PORT, &GPIO_InitStruct); 
    set_GPIO_value(BUS_BUSRQ_PORT, BUS_BUSRQ_PIN_MASK, BUS_BUSRQ_INACTIVE);

    // BUSAK
    GPIO_InitStruct.Pin = BUS_BUSAK_PIN_MASK;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(BUS_BUSAK_PORT, &GPIO_InitStruct); 

    // Address bus pins
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    for(int i = 0; i < address_line_count; i++) {
        GPIOLine* line = &address_lines[i];
        GPIO_InitStruct.Pin = 1U << line->pin;
        HAL_GPIO_Init(line->gpio, &GPIO_InitStruct); 
    }
}

// Caller has to guarantee A and D access will not collide with
// another peripheral; basically either Z80 BUSRQ or RESET
void BUS_read_memory_block(unsigned int a, unsigned int l, unsigned char *b)
{
    if((ALICE3_VERSION == ALICE3_V3) && ALICE3_V3_ARM_IS_RAM) {

        for(unsigned int u = a; u < a + l; u++)
            b[u - a] = ccmram_get(shuffle_address(u));

    } else {

        BUS_mastering_start();
        BUS_set_DATA_as_input();

        for(unsigned int u = a; u < a + l; u++)
            b[u - a] = BUS_read_memory_byte(u);

        BUS_set_DATA(gNextByteForReading);
        BUS_mastering_finish();
    }
}

// Guarantees no collisions through BUSRQ
// another peripheral; basically either Z80 BUSRQ or RESET
void BUS_write_IO(int io, unsigned char byte)
{
    BUS_mastering_start();
    BUS_set_DATA(0);
    BUS_set_DATA_as_output();

    BUS_write_io_byte(io, byte);

    BUS_set_DATA_as_input();
    BUS_set_DATA(gNextByteForReading);
    BUS_mastering_finish();
}


/*--------------------------------------------------------------------------*/
// IO writes

#define VIDEO_BOARD_OUTPUT_ADDR   0x80
#define VIDEO_BOARD_CONTROL_ADDR   0x81
#define VIDEO_BOARD_START_CLOCK   0x01

void VIDEO_output_string(char *c, int inverse)
{
    while(*c) {
        if(*c == '\n') {
            BUS_write_IO(VIDEO_BOARD_OUTPUT_ADDR, '\r');
            BUS_write_IO(VIDEO_BOARD_OUTPUT_ADDR, *c);
        } else
            BUS_write_IO(VIDEO_BOARD_OUTPUT_ADDR, *c + (inverse ? 128 : 0));
        c++;
    }
}

void VIDEO_start_clock()
{
    BUS_mastering_start();
    BUS_set_DATA(0);
    BUS_set_DATA_as_output();

    BUS_write_io_byte(VIDEO_BOARD_OUTPUT_ADDR, VIDEO_BOARD_START_CLOCK);

    BUS_set_DATA_as_input();
    BUS_set_DATA(gNextByteForReading);
    BUS_mastering_finish();
}


//----------------------------------------------------------------------------
// Alice 3 ROM (boot) image

unsigned char *gZ80BootImage;
unsigned int gZ80BootImageLength;

// Caller has to guarantee A and D access will not collide with
// another peripheral; basically either Z80 BUSRQ or RESET
int BUS_write_ROM_image(unsigned char *romimage_bytes, unsigned int romimage_length)
{
    int succeeded = 1;

    if(romimage_bytes == NULL) {
        printf("BUS_write_ROM_image : Z80 boot image is undefined (gZ80BootImage == NULL)\n");
        return 0;
    }

    if((ALICE3_VERSION == ALICE3_V3) && ALICE3_V3_ARM_IS_RAM) {

        for(unsigned int a = 0; a < romimage_length; a++)
            ccmram_set(shuffle_address(a), romimage_bytes[a]);

