lkesteloot/alice/alice3/io_board/stm32f4/ioboard.c
        for(unsigned int a = 0; a < romimage_length; a++) {
            unsigned char t = ccmram_get(shuffle_address(a));
            if(t != romimage_bytes[a]) {
                printf("BUS_write_ROM_image ccmram: expected 0x%02X byte at RAM address 0x%04X, read 0x%02X\n", romimage_bytes[a], a, t);
                succeeded = 0;
                break;
            }
        }

    } else {

        BUS_mastering_start();

        BUS_set_DATA(0);
        BUS_set_DATA_as_output();

        for(unsigned int a = 0; a < romimage_length; a++)
            BUS_write_memory_byte(a, romimage_bytes[a]);

        BUS_set_DATA_as_input();

        for(unsigned int a = 0; a < romimage_length; a++) {
            unsigned char t = BUS_read_memory_byte(a);
            if(t != romimage_bytes[a]) {
                printf("BUS_write_ROM_image bus : expected 0x%02X byte at RAM address 0x%04X, read 0x%02X\n", romimage_bytes[a], a, t);
                succeeded = 0;
                // break;
            }
        }

        BUS_set_DATA(gNextByteForReading);
        BUS_mastering_finish();

    }

    return succeeded;
}


//----------------------------------------------------------------------------
// reset the Z80 and restore to initial booting state

void Z80_reset()
{
    BUS_reset_start();
    VIDEO_start_clock();

    response_clear();
    command_clear();

    BUS_write_ROM_image(gZ80BootImage, gZ80BootImageLength);

    BUS_reset_finish();
}

//----------------------------------------------------------------------------
// stdio

#define OUTPUT_TO_SERIAL        0x01
#define OUTPUT_TO_VIDEO         0x02

int gOutputDevices = OUTPUT_TO_SERIAL;

void __io_putchar( char c )
{
    if(gOutputDevices & OUTPUT_TO_SERIAL)
        SERIAL_enqueue_one_char(c);
    if(gOutputDevices & OUTPUT_TO_VIDEO) {
        if(c == '\n') // XXX
            BUS_write_IO(VIDEO_BOARD_OUTPUT_ADDR, '\r');
        BUS_write_IO(VIDEO_BOARD_OUTPUT_ADDR, c);
    }
}

enum DebugLevels {
    DEBUG_SILENT = 0,
    DEBUG_ERRORS,
    DEBUG_WARNINGS,
    DEBUG_EVENTS,
    DEBUG_DATA,
    DEBUG_ALL,
    DEBUG_INSANE = 99,
};
int gDebugLevel = DEBUG_WARNINGS;

void logprintf(int level, char *fmt, ...)
{
    va_list args;
    static char dummy[512];

    if(level > gDebugLevel)
        return;

    va_start(args, fmt);
    vsprintf(dummy, fmt, args);
    va_end(args);
    
    char *s = dummy;
    while(*s) {
        putchar(*s++);
    }
    SERIAL_flush();

    if(!(gOutputDevices & OUTPUT_TO_VIDEO) && (level <= DEBUG_WARNINGS))
        VIDEO_output_string(dummy, 1);
}


//----------------------------------------------------------------------------
// AT and PS/2 Keyboard processing

#define KBD_QUEUE_CAPACITY 16

struct kbd_queue_struct {
    struct queue q;
    unsigned char queue[KBD_QUEUE_CAPACITY];
};
volatile struct kbd_queue_struct kbd_queue;

#define KEYBOARD_CLOCK_PIN_MASK GPIO_PIN_11
#define KEYBOARD_CLOCK_PORT GPIOB

#define KEYBOARD_DATA_PIN_MASK GPIO_PIN_12
#define KEYBOARD_DATA_PORT GPIOB

// Keyboard I/O constants
#define KBD_BIT_COUNT 11

volatile short kbd_bits = 0;
volatile unsigned short kbd_data = 0;
void KBD_init()
{
    GPIO_InitTypeDef  GPIO_InitStruct;

    // There's a possibility we could use USART for this
    // and remove some CPU work

    GPIO_InitStruct.Pin = KEYBOARD_CLOCK_PIN_MASK;
    GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(KEYBOARD_CLOCK_PORT, &GPIO_InitStruct); 

    GPIO_InitStruct.Pin = KEYBOARD_DATA_PIN_MASK;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(KEYBOARD_DATA_PORT, &GPIO_InitStruct); 

    /* Enable and set EXTI Line15-10 interrupt */
    HAL_NVIC_SetPriority(EXTI15_10_IRQn, 1, 0);
    HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);
}

void EXTI15_10_IRQHandler(void)
{
    __HAL_GPIO_EXTI_CLEAR_IT(KEYBOARD_CLOCK_PIN_MASK);
    NVIC_ClearPendingIRQ(EXTI15_10_IRQn);

    unsigned int keyboard_data_pin = GPIOB->IDR & KEYBOARD_DATA_PIN_MASK;
    unsigned int keyboard_data = keyboard_data_pin ? 1 : 0;

    kbd_data = (kbd_data >> 1) | (keyboard_data << 10);
    kbd_bits++;
    if(kbd_bits == KBD_BIT_COUNT) {
        if(queue_isfull(&kbd_queue.q)) {
            gKeyboardOverflowed = 1;
        } else {
            queue_enq(&kbd_queue.q, (kbd_data >> 1) & 0xff);
        }
        kbd_data = 0;
        kbd_bits = 0;
    }
}

void KBD_process_queue()
{
    int isEmpty = queue_isempty(&kbd_queue.q);
    if(!isEmpty) {
        unsigned char kb = queue_deq(&kbd_queue.q);
        if(gDumpKeyboardData)
            logprintf(DEBUG_DATA, "keyboard scan code: %02X\n", kb);
        int key = PS2_process_byte(kb);
        if(key >= 0) {
            disable_interrupts();
            console_enqueue_key_unsafe(key);
            enable_interrupts();
        }
    }
}


/*--------------------------------------------------------------------------*/
/* SD card -----------------------------------------------------------------*/

#define SPI_SS_PIN_MASK      GPIO_PIN_8
#define SPI_SS_PORT     GPIOA

SPI_HandleTypeDef gSPIHandle;

void HAL_SPI_MspInit(SPI_HandleTypeDef *hspi)
{
    GPIO_InitTypeDef  GPIO_InitStruct;

    /* Enable GPIO CK/TX/RX clocks */
    // __HAL_RCC_GPIOB_CLK_ENABLE();
    /* Enable SPI clock */
    __HAL_RCC_SPI2_CLK_ENABLE();

    /*##-2- Configure peripheral GPIO ##########################################*/

    // Alternate function SPI2, high speed, push-pull
    GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_MEDIUM;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;

    /* SPI SCK GPIO pin configuration  */
    GPIO_InitStruct.Pin       = GPIO_PIN_13;
    GPIO_InitStruct.Pull      = GPIO_NOPULL; // GPIO_PULLUP;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    /* SPI MISO GPIO pin configuration  */
    GPIO_InitStruct.Pin = GPIO_PIN_14;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL; // GPIO_PULLUP;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    /* SPI MOSI GPIO pin configuration  */
    GPIO_InitStruct.Pin = GPIO_PIN_15;
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull      = GPIO_NOPULL; // GPIO_PULLUP;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
}

void HAL_SPI_MspDeInit(SPI_HandleTypeDef *hspi)
{
    /*##-1- Reset peripherals ##################################################*/
    __HAL_RCC_SPI2_FORCE_RESET();
    __HAL_RCC_SPI2_RELEASE_RESET();

    /*##-2- Disable peripherals and GPIO Clocks ################################*/
    /* Configure SPI SCK as alternate function  */
    HAL_GPIO_DeInit(GPIOB, GPIO_PIN_13);
    /* Configure SPI MISO as alternate function  */
    HAL_GPIO_DeInit(GPIOB, GPIO_PIN_14);
    /* Configure SPI MOSI as alternate function  */
    HAL_GPIO_DeInit(GPIOB, GPIO_PIN_15);
}

void SPI_enable_sd()
{
    HAL_GPIO_WritePin(SPI_SS_PORT, SPI_SS_PIN_MASK, 0);     // SS true
    delay_ms(100);
}

void SPI_disable_sd()
{
    HAL_GPIO_WritePin(SPI_SS_PORT, SPI_SS_PIN_MASK, 1);     // SS false
    delay_ms(100);
}

// Postcondition: SPI configured for SD, SS high (false)
void SPI_config_for_sd()
{
    GPIO_InitTypeDef  GPIO_InitStruct;

