lkesteloot/alice/alice3/io_board/stm32f4/ioboard.c
            for(int i = 0; i < 8; i++) {
                LED_set_info(1);
                delay_ms(125);
                LED_set_info(0);
                delay_ms(125);
            }

        } else if(strcmp(gMonitorCommandLine, "panic") == 0) {

            printf("panicking now\n");
            panic();

        } else if(strcmp(gMonitorCommandLine, "bus") == 0) {

            printf("RESET %s\n", HAL_GPIO_ReadPin(Z80_RESET_PORT, Z80_RESET_PIN_MASK) ? "high" : "low");
            printf("HALT %s\n", HAL_GPIO_ReadPin(BUS_HALT_PORT, BUS_HALT_PIN_MASK) ? "high" : "low");
            printf("IORQ %s\n", HAL_GPIO_ReadPin(BUS_IORQ_PORT, BUS_IORQ_PIN_MASK) ? "high" : "low");
            printf("MREQ %s\n", HAL_GPIO_ReadPin(BUS_MREQ_PORT, BUS_MREQ_PIN_MASK) ? "high" : "low");
            printf("RD %s\n", HAL_GPIO_ReadPin(BUS_RD_PORT, BUS_RD_PIN_MASK) ? "high" : "low");
            printf("WR %s\n", HAL_GPIO_ReadPin(BUS_WR_PORT, BUS_WR_PIN_MASK) ? "high" : "low");
            printf("BUSRQ %s\n", HAL_GPIO_ReadPin(BUS_BUSRQ_PORT, BUS_BUSRQ_PIN_MASK) ? "high" : "low");
            printf("BUSAK %s\n", HAL_GPIO_ReadPin(BUS_BUSAK_PORT, BUS_BUSAK_PIN_MASK) ? "high" : "low");

        } else if(strncmp(gMonitorCommandLine, "chaff ", 6) == 0) {

            char *p = gMonitorCommandLine + 5;
            while(*p == ' ')
                p++;
            int addr = strtol(p, NULL, 0);

            BUS_mastering_start();
            BUS_set_DATA_as_input();
            BUS_set_ADDRESS(addr);
            set_GPIO_value(BUS_MREQ_PORT, BUS_MREQ_PIN_MASK, BUS_MREQ_ACTIVE);
            delay_us(1);
            set_GPIO_value(BUS_RD_PORT, BUS_RD_PIN_MASK, BUS_RD_ACTIVE);
            delay_us(1);

        } else if(strcmp(gMonitorCommandLine, "low128") == 0) {

            BUS_reset_start();

            static unsigned char buf[128];
            BUS_read_memory_block(0, 128, buf);

            printf("low 128 bytes of RAM:\n");
            dump_buffer_hex(4, buf, sizeof(buf));

            // BUS_reset_finish();

        } else if(strcmp(gMonitorCommandLine, "reset") == 0) {

            printf("Resetting Z-80 and communication buffers...\n");
            Z80_reset();

        } else if(strcmp(gMonitorCommandLine, "pass") == 0) {

            gSerialInputToMonitor = 0;
            printf("Press CTRL-A then CTRL-B to return to monitor.\n");

        } else if(strcmp(gMonitorCommandLine, "buffers") == 0) {

            printf("Command length: %d bytes\n", command_length);
            if(command_length > 0) {
                printf("Command buffer:\n");
                dump_buffer_hex(4, (unsigned char *)command_bytes, command_length);
            }

            printf("Response length: %d bytes\n", response_length);
            printf("Response next byte to put on bus: %d\n", response_index);
            if(response_length > 0) {
                printf("Response buffer:\n");
                dump_buffer_hex(4, (unsigned char *)response_bytes, response_length);
            }

        } else if(strcmp(gMonitorCommandLine, "version") == 0) {

            printf("%s\n", IOBOARD_FIRMWARE_VERSION_STRING);

        } else if(strncmp(gMonitorCommandLine, "debug ", 6) == 0) {

            char *p = gMonitorCommandLine + 5;
            while(*p == ' ')
                p++;
            gDebugLevel = strtol(p, NULL, 0);
            printf("Debug level set to %d\n", gDebugLevel);

        } else if(strncmp(gMonitorCommandLine, "spiwrite ", 9) == 0) {

            char *endptr = gMonitorCommandLine + 9;
            char *p;
            int count = 0;
            unsigned char buffer[16];
            do {
                p = endptr;
                buffer[count] = strtol(p, &endptr, 0);
                if(p != endptr)
                    count++;
            } while(endptr != p);
            printf("Writing %d bytes\n", count);
            dump_buffer_hex(4, buffer, count);

            spi_bulk(buffer, count);

            if(count == 1) {
                printf("Byte returned: 0x%02X\n", buffer[0]);
            } else {
                printf("Bytes returned:\n");
                dump_buffer_hex(4, buffer, count);
            }

        } else if(strncmp(gMonitorCommandLine, "spiread ", 8) == 0) {

            char *p = gMonitorCommandLine + 8;
            while(*p == ' ')
                p++;
            int count = strtol(p, NULL, 0);
            unsigned char buffer[16];
            if(count > sizeof(buffer)) {
                printf("count %d is larger than available buffer, truncating to %d\n", count, sizeof(buffer));
                count = sizeof(buffer);
            }
            spi_readn(buffer, count);
            if(count == 1) {
                printf("Byte returned: 0x%02X\n", buffer[0]);
            } else {
                printf("Bytes returned:\n");
                dump_buffer_hex(4, buffer, count);
            }

        } else if(strncmp(gMonitorCommandLine, "sdss ", 5) == 0) {

            char *p = gMonitorCommandLine + 4;
            while(*p == ' ')
                p++;
            int ss = strtol(p, NULL, 0);
            if(ss) {
                SPI_enable_sd();
                printf("/SS to SD card is enabled (GND)\n");
            } else {
                SPI_disable_sd();
                printf("/SS to SD card is disabled (+3.3V)\n");
            }

        } else if(strncmp(gMonitorCommandLine, "read ", 5) == 0) {

            char *p = gMonitorCommandLine + 4;
            while(*p == ' ')
                p++;
            gCachedBlockNumber = strtol(p, NULL, 0);
            if(sdcard_readblock(gCachedBlockNumber, gCachedBlock)) {
                dump_buffer_hex(4, gCachedBlock, BLOCK_SIZE);
            }

        } else {

            printf("Unknown command.\n");
            usage();
        }

        printf("* ");
        gMonitorCommandLineLength = 0;

    } else {

        if(c == 127 || c == '\b') {
            if(gMonitorCommandLineLength > 0) {
                putchar('\b');
                putchar(' ');
                putchar('\b');
                gMonitorCommandLineLength--;
            } else {
                bell();
            }
        } else {
            if(gMonitorCommandLineLength < sizeof(gMonitorCommandLine) - 1) {
                putchar(c);
                gMonitorCommandLine[gMonitorCommandLineLength++] = c;
            } else {
                bell();
            }
        }
    // TODO - upload data, write block
    }
}


void process_command_read(unsigned char command_request, volatile unsigned char *command_bytes)
{
    static unsigned char buffer[128];
    unsigned int disk = command_bytes[1];
    unsigned int sector = command_bytes[2] + 256 * command_bytes[3];
    unsigned int track = command_bytes[4] + 256 * command_bytes[5];
    unsigned int lba_sector = track * SECTORS_PER_TRACK + sector;

    logprintf(DEBUG_EVENTS, "read disk %d, sector %d, track %d, lba sector %d\n", disk, sector, track, lba_sector);

    if(disk > gDiskImageCount) { 
        logprintf(DEBUG_WARNINGS, "asked for disk out of range\n");
        response_append(IOBOARD_FAILURE);
        return;
    }

    FRESULT result = f_lseek(&gDiskImageFiles[disk], lba_sector * SECTOR_SIZE);
    if(result != FR_OK) {
        logprintf(DEBUG_ERRORS, "ERROR: couldn't seek to sector %d, track %d in \"%s\", FatFS result %d\n", sector, track, gDiskImageFilenames[disk], result);
        response_append(IOBOARD_FAILURE);
        return;
    }

