lkesteloot/alice/alice3/io_board/stm32f4/ioboard.c
    UINT wasread;
    result = f_read(&gDiskImageFiles[disk], buffer, SECTOR_SIZE, &wasread);
    if(result != FR_OK) {
        logprintf(DEBUG_ERRORS, "ERROR: couldn't read sector %d, track %d from \"%s\", FatFS result %d\n", sector, track, gDiskImageFilenames[disk], result);
        response_append(IOBOARD_FAILURE);
        return;
    }
    if(wasread != SECTOR_SIZE) {
        logprintf(DEBUG_ERRORS, "ERROR: tried to read %lu bytes from sector %d, track %d of \"%s\", only read %ld\n", SECTOR_SIZE, gDiskImageFilenames[disk], sector, track, wasread);
        response_append(IOBOARD_FAILURE);
        return;
    }
    if(gDebugLevel >= DEBUG_ALL) dump_buffer_hex(4, buffer, SECTOR_SIZE);

    response_append(IOBOARD_SUCCESS);

    for(unsigned int u = 0; u < SECTOR_SIZE; u++)
        response_append(buffer[u]);

    if(command_request == IOBOARD_CMD_READ_SUM) {
        unsigned short sum = 0;

        for(unsigned int u = 0; u < SECTOR_SIZE; u++)
            sum += buffer[u];

        response_append(sum & 0xff);
        response_append((sum >> 8) & 0xff);
        logprintf(DEBUG_ALL, "checksum calculated as %u: 0x%02X then 0x%02X\n", sum, sum & 0xff, (sum >> 8) & 0xff);
    }
}

void process_command_write(unsigned char command_request, volatile unsigned char *command_bytes)
{
    unsigned int disk = command_bytes[1];
    unsigned int sector = command_bytes[2] + 256 * command_bytes[3];
    unsigned int track = command_bytes[4] + 256 * command_bytes[5];
    unsigned int lba_sector = track * SECTORS_PER_TRACK + sector;

    logprintf(DEBUG_EVENTS, "write disk %d, sector %d, track %d, lba sector %d\n", disk, sector, track, lba_sector);

    if(disk > gDiskImageCount) { 
        logprintf(DEBUG_WARNINGS, "asked for disk out of range\n");
        response_append(IOBOARD_FAILURE);
        return;
    }

    if(command_request == IOBOARD_CMD_WRITE_SUM) {
        unsigned short sum = 0;
        unsigned char offset = 6;
        for(unsigned int u = 0; u < SECTOR_SIZE; u++)
            sum += command_bytes[offset + u];
        unsigned short theirs = command_bytes[134] | (command_bytes[135] << 8);
        if(sum != theirs) {
            logprintf(DEBUG_WARNINGS, "WARNING: IOBOARD_CMD_WRITE_SUM checksum does not match\n");
            // XXX retry?
            response_append(IOBOARD_FAILURE);
            return;
        }
    }

    FRESULT result = f_lseek(&gDiskImageFiles[disk], lba_sector * SECTOR_SIZE);
    if(result != FR_OK) {
        logprintf(DEBUG_ERRORS, "ERROR: couldn't seek to sector %d, track %d in \"%s\", FatFS result %d\n", sector, track, gDiskImageFilenames[disk], result);
        panic();
    }

    UINT waswritten;
    result = f_write(&gDiskImageFiles[disk], (unsigned char*)(command_bytes + 6), SECTOR_SIZE, &waswritten);
    if(result != FR_OK) {
        logprintf(DEBUG_ERRORS, "ERROR: couldn't write to sector %d, track %d in \"%s\", FatFS result %d\n", sector, track, gDiskImageFilenames[disk], result);
        response_append(IOBOARD_FAILURE);
        return;
    }
    if(waswritten != SECTOR_SIZE) {
        logprintf(DEBUG_ERRORS, "ERROR: tried to write %lu bytes to sector %d, track %d of \"%s\", only read %ld\n", SECTOR_SIZE, gDiskImageFilenames[disk], sector, track, waswritten);
        response_append(IOBOARD_FAILURE);
        return;
    }
    // XXX Should probably set this up as a timeout, so multiple
    // sectors writes can take advantage of single block
    f_sync(&gDiskImageFiles[disk]);

    response_append(IOBOARD_SUCCESS);
}

void check_and_process_command()
{
    unsigned char isEmpty;

    if(command_length == 0)
        return;

    unsigned char command = command_bytes[0];

    if((command < IOBOARD_CMD_MIN) || (command > IOBOARD_CMD_MAX)) {

        logprintf(DEBUG_ERRORS, "ERROR: Unknown command 0x%02X received\n", command);
        command_clear();
        return;
    }

    if(command_length < command_lengths[command])
        return;

    logprintf(DEBUG_EVENTS, "complete command received.\n");
    if(command_length > command_lengths[command]) {
        logprintf(DEBUG_ERRORS, "ERROR: command buffer longer than expected for command.\n");
    }

    if(command == IOBOARD_CMD_NONE)
        return;

    response_start();
    LED_set_info(1);
    switch(command) {
        case IOBOARD_CMD_READ:
        case IOBOARD_CMD_READ_SUM:
            process_command_read(command, command_bytes);
            break;

        case IOBOARD_CMD_WRITE:
        case IOBOARD_CMD_WRITE_SUM:
            process_command_write(command, command_bytes);
            break;

        case IOBOARD_CMD_SEROUT: {
            putchar(command_bytes[1]);
            response_append(IOBOARD_SUCCESS);
            break;
        }

        case IOBOARD_CMD_CONST: {
            logprintf(DEBUG_EVENTS, "CONST\n");
            isEmpty = queue_isempty(&con_queue.q);
            if(!isEmpty)
                response_append(IOBOARD_READY);
            else
                response_append(IOBOARD_NOT_READY);
            break;
        }

        case IOBOARD_CMD_CONIN: {
            unsigned char c;
            logprintf(DEBUG_EVENTS, "CONIN\n");
            isEmpty = queue_isempty(&con_queue.q);
            if(!isEmpty) {
                c = queue_deq(&con_queue.q);
                response_append(IOBOARD_SUCCESS);
                response_append(c);
            } else {
                printf("Hm, char wasn't actually ready at CONIN\n");
                response_append(IOBOARD_SUCCESS);
                response_append(0);
            }
            break;
        }

        default: {
            printf("unexpected command 0x%02X from z80!\n", command);
            break;
        }
    }
    LED_set_info(0);

    if(response_staging_length > 0) {
        logprintf(DEBUG_DATA, "will respond with %d\n", response_staging_length);
        command_clear();
        disable_interrupts();
        response_finish();
        enable_interrupts();
        gResponseWasWaiting = 1;
    }
}

void check_and_process_HALT()
{
    static int Z80WasInHALT = 0;
    gZ80IsInHALT = !HAL_GPIO_ReadPin(BUS_HALT_PORT, BUS_HALT_PIN_MASK);
    if(gZ80IsInHALT != Z80WasInHALT) {
        gOutputDevices = OUTPUT_TO_VIDEO | OUTPUT_TO_SERIAL;
        if(gZ80IsInHALT) {
            logprintf(DEBUG_EVENTS, "Z80 has HALTed.\n");
        } else {
            logprintf(DEBUG_EVENTS, "Z80 has exited HALT state.\n");
        }
        gOutputDevices = OUTPUT_TO_SERIAL;
        Z80WasInHALT = gZ80IsInHALT;
    }
}

