lkesteloot/alice/alice3/io_board/stm32f4/ioboard.c
void check_and_process_soft_reset()
{
    if(gResetTheZ80 || HAL_GPIO_ReadPin(RESET_BUTTON_PORT, RESET_BUTTON_PIN_MASK)) {
        while(HAL_GPIO_ReadPin(RESET_BUTTON_PORT, RESET_BUTTON_PIN_MASK));
        delay_ms(RESET_BUTTON_DELAY_MS);// software debounce
        gResetTheZ80 = 0;

        Z80_reset();

        logprintf(DEBUG_EVENTS, "Z80 was reset\n");
    }
}

void check_exceptional_conditions()
{
    if(gConsoleOverflowed) {
        logprintf(DEBUG_WARNINGS, "WARNING: Console input queue overflow\n");
        gConsoleOverflowed = 0;
    }

    if(gKeyboardOverflowed) {
        logprintf(DEBUG_WARNINGS, "WARNING: Keyboard data queue overflow\n");
        gKeyboardOverflowed = 0;
    }

    if(gReadWasAlreadyInactive) {
        logprintf(DEBUG_WARNINGS, "A");
        gReadWasAlreadyInactive = 0;
    }

    if(gUnclaimedRead) {
        BUS_write_IO(VIDEO_BOARD_OUTPUT_ADDR, 'R' + 128);
        logprintf(DEBUG_WARNINGS, "(%04X)", gUnclaimedReadAddress);
        gUnclaimedRead = 0;
    }

    if(gUnclaimedWrite) {
        BUS_write_IO(VIDEO_BOARD_OUTPUT_ADDR, 'W' + 128);
        logprintf(DEBUG_WARNINGS, "(%04X,%02X)", gUnclaimedWriteAddress, gUnclaimedWriteData);
        gUnclaimedWrite = 0;
    }
}

void process_monitor_queue()
{
    unsigned char isEmpty = queue_isempty(&mon_queue.q);
    static unsigned char escapeBackToMonitor = 0;

    if(!isEmpty) {
        unsigned char c = queue_deq(&mon_queue.q);
        if(gSerialInputToMonitor)
            process_local_key(c);
        else {
            if(escapeBackToMonitor == 0 && c == 1)
                escapeBackToMonitor = 1;
            else if(escapeBackToMonitor != 0 && c == 2) {
                escapeBackToMonitor = 0;
                gSerialInputToMonitor = 1;
                printf("Serial input returned to monitor\n");
            } else {
                escapeBackToMonitor = 0;
                disable_interrupts();
                console_enqueue_key_unsafe(c);
                enable_interrupts();
            }
        }
    }
}

int read_bootrom()
{
    FIL f;
    FRESULT result = f_open (&f, "bootrom.bin", FA_READ | FA_OPEN_EXISTING);

    if(result != FR_OK) {
        logprintf(DEBUG_ERRORS, "ERROR: couldn't open \"bootrom.bin\" for reading, FatFS result %d\n", result);
        return 0;
    }

    gZ80BootImageLength = f_size(&f);

    gZ80BootImage = (unsigned char*)malloc(gZ80BootImageLength);
    if(gZ80BootImage == NULL) {
        logprintf(DEBUG_ERRORS, "ERROR: couldn't allocate %lu bytes to read Z80 boot image\n", gZ80BootImageLength);
        return 0;
    }

    UINT wasread;
    result = f_read(&f, gZ80BootImage, gZ80BootImageLength, &wasread);
    if(result != FR_OK) {
        logprintf(DEBUG_ERRORS, "ERROR: couldn't read from \"bootrom.bin\", FatFS result %d\n", result);
        free(gZ80BootImage);
        gZ80BootImage = NULL;
        return 0;
    }

    if(wasread != gZ80BootImageLength) {
        logprintf(DEBUG_ERRORS, "ERROR: tried to read %lu bytes, only read %ld\n", gZ80BootImageLength, wasread);
        free(gZ80BootImage);
        gZ80BootImage = NULL;
        return 0;
    }

    f_close(&f);
    return 1;
}

#define PROP_READY_PIN_MASK GPIO_PIN_14
#define PROP_READY_PORT GPIOC

void VIDEO_init()
{
    // set PROP_READY pull up
    GPIO_InitTypeDef  GPIO_InitStruct;
    GPIO_InitStruct.Pin = PROP_READY_PIN_MASK;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(PROP_READY_PORT, &GPIO_InitStruct); 
}

#define PROP_READY_TIMEOUT_MILLIS 5000

void VIDEO_wait()
{
    if(ALICE3_VERSION == ALICE3_V3) {

        // Only on Alice3 V3 does ARM start before Propeller.
        // (On V1, ARM has 5-second delay while Propeller has 1-second delay)

        int started = HAL_GetTick();
        while(HAL_GPIO_ReadPin(PROP_READY_PORT, PROP_READY_PIN_MASK)) {
            int now = HAL_GetTick();
            if(now - started > PROP_READY_TIMEOUT_MILLIS) {
                printf("PANIC: timed out after waiting 5 seconds for PROP_READY\n");
                SERIAL_flush();
                panic();
            }
        }
    }
}

const int gStandaloneARM = 0;

#define ALICE3_SRAM_SIZE (256 * 1024)

int BUS_check_RAM()
{
    int succeeded = 1;

    if((ALICE3_VERSION == ALICE3_V3) && !ALICE3_V3_ARM_IS_RAM) {
        int t;

        BUS_mastering_start();

        BUS_set_DATA(0);
        BUS_set_DATA_as_output();

        t = 0;
        for(unsigned int a = 0; a < ALICE3_SRAM_SIZE; a++) {
            BUS_write_memory_byte(a, t);
            t = (t + 251) % 256;
        }

        BUS_set_DATA_as_input();

        t = 0;
        for(unsigned int a = 0; a < ALICE3_SRAM_SIZE; a++) {
            unsigned char q = BUS_read_memory_byte(a);
            if(q != t) {
                printf("BUS_check_RAM : expected 0x%02X byte at RAM address 0x%X, read 0x%02X\n", t, a, q);
                succeeded = 0;
                break;
            }
            t = (t + 251) % 256;
        }

        BUS_set_DATA(gNextByteForReading);
        BUS_mastering_finish();

    }

    return succeeded;
}

void uart_received(char c)
{
    queue_enq(&mon_queue.q, c);
}

int main()
{
    system_init();

    queue_init(&mon_queue.q, MON_QUEUE_CAPACITY);
    queue_init(&kbd_queue.q, KBD_QUEUE_CAPACITY);
    queue_init(&con_queue.q, CON_QUEUE_CAPACITY);

    LED_init();
    LED_beat_heart();

    setbuf(stdout, NULL);

    SERIAL_init(); // transmit and receive but global interrupts disabled
    LED_beat_heart();

    printf("\n\nAlice 3 I/O firmware, %s\n", IOBOARD_FIRMWARE_VERSION_STRING);
    printf("System core clock: %lu MHz\n", SystemCoreClock / 1000000);

    LED_beat_heart();
    SERIAL_flush();

    RESET_BUTTON_init();

    if(!gStandaloneARM) {
        VIDEO_init();
        VIDEO_wait();

	BUS_reset_init(); // Pull Z80 RESET low (active), but Z80
			  // may not actually reset until some clock
			  // cycles have run.  So run clock below before
                          // trying to access bus
        BUS_init();

        VIDEO_start_clock();
        VIDEO_output_string("Alice 3 I/O firmware, " IOBOARD_FIRMWARE_VERSION_STRING "\r\n", 0);

        if(!BUS_check_RAM()) {
            panic();
        }

