lkesteloot/alice/alice3/io_board/stm32f4/ioboard.c
    }

    SPI_config_for_sd();
    LED_beat_heart();

    if(!sdcard_init())
        printf("Failed to start access to SD card as SPI!!\n");
    else 
        printf("SD Card interface is initialized for SPI\n");
    LED_beat_heart();
    SERIAL_flush();

    if(0) {
        test_sd_card();
        LED_beat_heart();
    }

    FRESULT result = f_mount(&gFATVolume, "0:", 1);
    if(result != FR_OK) {
        logprintf(DEBUG_ERRORS, "ERROR: FATFS mount result is %d\n", result);
        panic();
    } else {
        printf("Mounted FATFS from SD card successfully.\n");
    }
    SERIAL_flush();

    int success = read_bootrom();
    if(!success) {
        panic();
    }
    LED_beat_heart();

    success = read_disk_image_list();
    if(!success) {
        panic();
    }
    if(0)
        for(int i = 0; i < gDiskImageCount; i++) {
            printf("disk %c: \"%s\"\n", 'A' + i, gDiskImageFilenames[i]);
        }
    success = open_disk_images();
    if(!success) {
        panic();
    }
    LED_beat_heart();

    if(0) {
        unsigned char block[128];
        UINT wasread;
        for(int i = 0; i < gDiskImageCount; i++) {
            result = f_read(&gDiskImageFiles[i], block, sizeof(block), &wasread);
            printf("\"%s\", read resulted in %d, got %d bytes:\n", gDiskImageFilenames[i], result, wasread);
            dump_buffer_hex(4, block, sizeof(block));
        }
    }

    KBD_init();
    LED_beat_heart();

    if(!gStandaloneARM) { // Can't have floating BUS in test mode

        BUS_reset_start();
        if(!BUS_write_ROM_image(gZ80BootImage, gZ80BootImageLength)) {
            // panic();
        }
        delay_ms(1); // XXX delay for at least 4 Z80 clock cycles, maybe 10us
        BUS_reset_finish();
    }

    printf("* ");
    SERIAL_flush();

    for(;;) {

        SERIAL_try_to_transmit_buffers();
        LED_beat_heart();

        SERIAL_poll_continue();

        process_monitor_queue();

        check_and_process_command();

        KBD_process_queue();

        check_exceptional_conditions();

        if(gResponseWasWaiting && !response_waiting) {
            logprintf(DEBUG_EVENTS, "response packet was read\n");
            gResponseWasWaiting = 0;
        }

        check_and_process_soft_reset();

        check_and_process_HALT();
    }

    // should not reach
    panic();
}
